test/performance.test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 10
      arrivalRate: 50
      name: Testing
  variables:
    password: "1aXaaaaa"
  processor: "./performanceUtils.js"
  http:
    timeout: 30
scenarios:
  - name: "Users"
    flow:
      - function: "generateLogin"
      - post:
          url: "/register"
          json:
            login: "{{ login }}"
            password: "{{ password }}"
            nameFirst: "User"
            nameLast: "Test"
      - post:
          url: "/login"
          headers:
            X-Forwarded-Proto: "https"
          json:
            login: "{{ login }}"
            password: "{{ password }}"